{
    "PAD_None": 0,
    "BOS_None": 1,
    "EOS_None": 2,
    "PRE_None": 3,
    "SUF_None": 4,
    "INF1_None": 5,
    "INF2_None": 6,
    "INF3_None": 7,
    "INF4_None": 8,
    "INF5_None": 9,
    "INF6_None": 10,
    "INF7_None": 11,
    "INF8_None": 12,
    "INF9_None": 13,
    "INF10_None": 14,
    "INF11_None": 15,
    "INF12_None": 16,
    "INF13_None": 17,
    "INF14_None": 18,
    "INF15_None": 19,
    "INF16_None": 20,
    "Bar_None": 21,
    "Pitch_21": 22,
    "Pitch_22": 23,
    "Pitch_23": 24,
    "Pitch_24": 25,
    "Pitch_25": 26,
    "Pitch_26": 27,
    "Pitch_27": 28,
    "Pitch_28": 29,
    "Pitch_29": 30,
    "Pitch_30": 31,
    "Pitch_31": 32,
    "Pitch_32": 33,
    "Pitch_33": 34,
    "Pitch_34": 35,
    "Pitch_35": 36,
    "Pitch_36": 37,
    "Pitch_37": 38,
    "Pitch_38": 39,
    "Pitch_39": 40,
    "Pitch_40": 41,
    "Pitch_41": 42,
    "Pitch_42": 43,
    "Pitch_43": 44,
    "Pitch_44": 45,
    "Pitch_45": 46,
    "Pitch_46": 47,
    "Pitch_47": 48,
    "Pitch_48": 49,
    "Pitch_49": 50,
    "Pitch_50": 51,
    "Pitch_51": 52,
    "Pitch_52": 53,
    "Pitch_53": 54,
    "Pitch_54": 55,
    "Pitch_55": 56,
    "Pitch_56": 57,
    "Pitch_57": 58,
    "Pitch_58": 59,
    "Pitch_59": 60,
    "Pitch_60": 61,
    "Pitch_61": 62,
    "Pitch_62": 63,
    "Pitch_63": 64,
    "Pitch_64": 65,
    "Pitch_65": 66,
    "Pitch_66": 67,
    "Pitch_67": 68,
    "Pitch_68": 69,
    "Pitch_69": 70,
    "Pitch_70": 71,
    "Pitch_71": 72,
    "Pitch_72": 73,
    "Pitch_73": 74,
    "Pitch_74": 75,
    "Pitch_75": 76,
    "Pitch_76": 77,
    "Pitch_77": 78,
    "Pitch_78": 79,
    "Pitch_79": 80,
    "Pitch_80": 81,
    "Pitch_81": 82,
    "Pitch_82": 83,
    "Pitch_83": 84,
    "Pitch_84": 85,
    "Pitch_85": 86,
    "Pitch_86": 87,
    "Pitch_87": 88,
    "Pitch_88": 89,
    "Pitch_89": 90,
    "Pitch_90": 91,
    "Pitch_91": 92,
    "Pitch_92": 93,
    "Pitch_93": 94,
    "Pitch_94": 95,
    "Pitch_95": 96,
    "Pitch_96": 97,
    "Pitch_97": 98,
    "Pitch_98": 99,
    "Pitch_99": 100,
    "Pitch_100": 101,
    "Pitch_101": 102,
    "Pitch_102": 103,
    "Pitch_103": 104,
    "Pitch_104": 105,
    "Pitch_105": 106,
    "Pitch_106": 107,
    "Pitch_107": 108,
    "Pitch_108": 109,
    "Velocity_3": 110,
    "Velocity_7": 111,
    "Velocity_11": 112,
    "Velocity_15": 113,
    "Velocity_19": 114,
    "Velocity_23": 115,
    "Velocity_27": 116,
    "Velocity_31": 117,
    "Velocity_35": 118,
    "Velocity_39": 119,
    "Velocity_43": 120,
    "Velocity_47": 121,
    "Velocity_51": 122,
    "Velocity_55": 123,
    "Velocity_59": 124,
    "Velocity_63": 125,
    "Velocity_67": 126,
    "Velocity_71": 127,
    "Velocity_75": 128,
    "Velocity_79": 129,
    "Velocity_83": 130,
    "Velocity_87": 131,
    "Velocity_91": 132,
    "Velocity_95": 133,
    "Velocity_99": 134,
    "Velocity_103": 135,
    "Velocity_107": 136,
    "Velocity_111": 137,
    "Velocity_115": 138,
    "Velocity_119": 139,
    "Velocity_123": 140,
    "Velocity_127": 141,
    "Duration_0.1.12": 142,
    "Duration_0.2.12": 143,
    "Duration_0.3.12": 144,
    "Duration_0.4.12": 145,
    "Duration_0.5.12": 146,
    "Duration_0.6.12": 147,
    "Duration_0.7.12": 148,
    "Duration_0.8.12": 149,
    "Duration_0.9.12": 150,
    "Duration_0.10.12": 151,
    "Duration_0.11.12": 152,
    "Duration_1.0.12": 153,
    "Duration_1.1.12": 154,
    "Duration_1.2.12": 155,
    "Duration_1.3.12": 156,
    "Duration_1.4.12": 157,
    "Duration_1.5.12": 158,
    "Duration_1.6.12": 159,
    "Duration_1.7.12": 160,
    "Duration_1.8.12": 161,
    "Duration_1.9.12": 162,
    "Duration_1.10.12": 163,
    "Duration_1.11.12": 164,
    "Duration_2.0.12": 165,
    "Duration_2.1.12": 166,
    "Duration_2.2.12": 167,
    "Duration_2.3.12": 168,
    "Duration_2.4.12": 169,
    "Duration_2.5.12": 170,
    "Duration_2.6.12": 171,
    "Duration_2.7.12": 172,
    "Duration_2.8.12": 173,
    "Duration_2.9.12": 174,
    "Duration_2.10.12": 175,
    "Duration_2.11.12": 176,
    "Duration_3.0.12": 177,
    "Duration_3.1.12": 178,
    "Duration_3.2.12": 179,
    "Duration_3.3.12": 180,
    "Duration_3.4.12": 181,
    "Duration_3.5.12": 182,
    "Duration_3.6.12": 183,
    "Duration_3.7.12": 184,
    "Duration_3.8.12": 185,
    "Duration_3.9.12": 186,
    "Duration_3.10.12": 187,
    "Duration_3.11.12": 188,
    "Duration_4.0.12": 189,
    "Position_0": 190,
    "Position_1": 191,
    "Position_2": 192,
    "Position_3": 193,
    "Position_4": 194,
    "Position_5": 195,
    "Position_6": 196,
    "Position_7": 197,
    "Position_8": 198,
    "Position_9": 199,
    "Position_10": 200,
    "Position_11": 201,
    "Position_12": 202,
    "Position_13": 203,
    "Position_14": 204,
    "Position_15": 205,
    "Position_16": 206,
    "Position_17": 207,
    "Position_18": 208,
    "Position_19": 209,
    "Position_20": 210,
    "Position_21": 211,
    "Position_22": 212,
    "Position_23": 213,
    "Position_24": 214,
    "Position_25": 215,
    "Position_26": 216,
    "Position_27": 217,
    "Position_28": 218,
    "Position_29": 219,
    "Position_30": 220,
    "Position_31": 221,
    "Position_32": 222,
    "Position_33": 223,
    "Position_34": 224,
    "Position_35": 225,
    "Position_36": 226,
    "Position_37": 227,
    "Position_38": 228,
    "Position_39": 229,
    "Position_40": 230,
    "Position_41": 231,
    "Position_42": 232,
    "Position_43": 233,
    "Position_44": 234,
    "Position_45": 235,
    "Position_46": 236,
    "Position_47": 237,
    "Position_48": 238,
    "Position_49": 239,
    "Position_50": 240,
    "Position_51": 241,
    "Position_52": 242,
    "Position_53": 243,
    "Position_54": 244,
    "Position_55": 245,
    "Position_56": 246,
    "Position_57": 247,
    "Position_58": 248,
    "Position_59": 249,
    "Position_60": 250,
    "Position_61": 251,
    "Position_62": 252,
    "Position_63": 253,
    "Position_64": 254,
    "Position_65": 255,
    "Position_66": 256,
    "Position_67": 257,
    "Position_68": 258,
    "Position_69": 259,
    "Position_70": 260,
    "Position_71": 261,
    "Position_72": 262,
    "Position_73": 263,
    "Position_74": 264,
    "Position_75": 265,
    "Position_76": 266,
    "Position_77": 267,
    "Position_78": 268,
    "Position_79": 269,
    "Position_80": 270,
    "Position_81": 271,
    "Position_82": 272,
    "Position_83": 273,
    "Position_84": 274,
    "Position_85": 275,
    "Position_86": 276,
    "Position_87": 277,
    "Position_88": 278,
    "Position_89": 279,
    "Position_90": 280,
    "Position_91": 281,
    "Position_92": 282,
    "Position_93": 283,
    "Position_94": 284,
    "Position_95": 285,
    "Position_96": 286,
    "Position_97": 287,
    "Position_98": 288,
    "Position_99": 289,
    "Position_100": 290,
    "Position_101": 291,
    "Position_102": 292,
    "Position_103": 293,
    "Position_104": 294,
    "Position_105": 295,
    "Position_106": 296,
    "Position_107": 297,
    "Position_108": 298,
    "Position_109": 299,
    "Position_110": 300,
    "Position_111": 301,
    "Position_112": 302,
    "Position_113": 303,
    "Position_114": 304,
    "Position_115": 305,
    "Position_116": 306,
    "Position_117": 307,
    "Position_118": 308,
    "Position_119": 309,
    "Position_120": 310,
    "Position_121": 311,
    "Position_122": 312,
    "Position_123": 313,
    "Position_124": 314,
    "Position_125": 315,
    "Position_126": 316,
    "Position_127": 317,
    "Position_128": 318,
    "Position_129": 319,
    "Position_130": 320,
    "Position_131": 321,
    "Position_132": 322,
    "Position_133": 323,
    "Position_134": 324,
    "Position_135": 325,
    "Position_136": 326,
    "Position_137": 327,
    "Position_138": 328,
    "Position_139": 329,
    "Position_140": 330,
    "Position_141": 331,
    "Position_142": 332,
    "Position_143": 333,
    "Tempo_40.0": 334,
    "Tempo_43.33": 335,
    "Tempo_46.67": 336,
    "Tempo_50.0": 337,
    "Tempo_53.33": 338,
    "Tempo_56.67": 339,
    "Tempo_60.0": 340,
    "Tempo_63.33": 341,
    "Tempo_66.67": 342,
    "Tempo_70.0": 343,
    "Tempo_73.33": 344,
    "Tempo_76.67": 345,
    "Tempo_80.0": 346,
    "Tempo_83.33": 347,
    "Tempo_86.67": 348,
    "Tempo_90.0": 349,
    "Tempo_93.33": 350,
    "Tempo_96.67": 351,
    "Tempo_100.0": 352,
    "Tempo_103.33": 353,
    "Tempo_106.67": 354,
    "Tempo_110.0": 355,
    "Tempo_113.33": 356,
    "Tempo_116.67": 357,
    "Tempo_120.0": 358,
    "Tempo_123.33": 359,
    "Tempo_126.67": 360,
    "Tempo_130.0": 361,
    "Tempo_133.33": 362,
    "Tempo_136.67": 363,
    "Tempo_140.0": 364,
    "Tempo_143.33": 365,
    "Tempo_146.67": 366,
    "Tempo_150.0": 367,
    "Tempo_153.33": 368,
    "Tempo_156.67": 369,
    "Tempo_160.0": 370,
    "Tempo_163.33": 371,
    "Tempo_166.67": 372,
    "Tempo_170.0": 373,
    "Tempo_173.33": 374,
    "Tempo_176.67": 375,
    "Tempo_180.0": 376,
    "Tempo_183.33": 377,
    "Tempo_186.67": 378,
    "Tempo_190.0": 379,
    "Tempo_193.33": 380,
    "Tempo_196.67": 381,
    "Tempo_200.0": 382,
    "Tempo_203.33": 383,
    "Tempo_206.67": 384,
    "Tempo_210.0": 385,
    "Tempo_213.33": 386,
    "Tempo_216.67": 387,
    "Tempo_220.0": 388,
    "Tempo_223.33": 389,
    "Tempo_226.67": 390,
    "Tempo_230.0": 391,
    "Tempo_233.33": 392,
    "Tempo_236.67": 393,
    "Tempo_240.0": 394,
    "Tempo_243.33": 395,
    "Tempo_246.67": 396,
    "Tempo_250.0": 397,
    "TimeSig_3/8": 398,
    "TimeSig_5/8": 399,
    "TimeSig_6/8": 400,
    "TimeSig_7/8": 401,
    "TimeSig_9/8": 402,
    "TimeSig_10/8": 403,
    "TimeSig_11/8": 404,
    "TimeSig_12/8": 405,
    "TimeSig_2/4": 406,
    "TimeSig_3/4": 407,
    "TimeSig_4/4": 408,
    "TimeSig_5/4": 409,
    "TimeSig_6/4": 410,
    "TimeSig_2/2": 411,
    "TimeSig_3/2": 412
}