BOS_None
EOS_None
SEP_None
PAD_None
MASK_None
Tempo_60
Tempo_65
Tempo_69
Tempo_74
Tempo_78
Tempo_83
Tempo_87
Tempo_92
Tempo_96
Tempo_101
Tempo_105
Tempo_110
Tempo_114
Tempo_119
Tempo_123
Tempo_128
Tempo_132
Tempo_137
Tempo_141
Tempo_146
Tempo_150
Tempo_155
Tempo_159
Tempo_164
Tempo_168
Tempo_173
Tempo_177
Tempo_182
Tempo_186
Tempo_191
Tempo_195
Tempo_200
Program_0
Program_1
Program_2
Program_3
Program_4
Program_5
Program_6
Program_7
Program_8
Program_9
Program_10
Program_11
Program_12
Program_13
Program_14
Program_15
Program_16
Program_17
Program_18
Program_19
Program_20
Program_21
Program_22
Program_23
Program_24
Program_25
Program_26
Program_27
Program_28
Program_29
Program_30
Program_31
Program_32
Program_33
Program_34
Program_35
Program_36
Program_37
Program_38
Program_39
Program_40
Program_41
Program_42
Program_43
Program_44
Program_45
Program_46
Program_47
Program_48
Program_49
Program_50
Program_51
Program_52
Program_53
Program_54
Program_55
Program_56
Program_57
Program_58
Program_59
Program_60
Program_61
Program_62
Program_63
Program_64
Program_65
Program_66
Program_67
Program_68
Program_69
Program_70
Program_71
Program_72
Program_73
Program_74
Program_75
Program_76
Program_77
Program_78
Program_79
Program_80
Program_81
Program_82
Program_83
Program_84
Program_85
Program_86
Program_87
Program_88
Program_89
Program_90
Program_91
Program_92
Program_93
Program_94
Program_95
Program_96
Program_97
Program_98
Program_99
Program_100
Program_101
Program_102
Program_103
Program_104
Program_105
Program_106
Program_107
Program_108
Program_109
Program_110
Program_111
Program_112
Program_113
Program_114
Program_115
Program_116
Program_117
Program_118
Program_119
Program_120
Program_121
Program_122
Program_123
Program_124
Program_125
Program_126
Program_127
Program_Drums
Program_inactive
Pitch_0
Pitch_1
Pitch_2
Pitch_3
Pitch_4
Pitch_5
Pitch_6
Pitch_7
Pitch_8
Pitch_9
Pitch_10
Pitch_11
Pitch_12
Pitch_13
Pitch_14
Pitch_15
Pitch_16
Pitch_17
Pitch_18
Pitch_19
Pitch_20
Pitch_21
Pitch_22
Pitch_23
Pitch_24
Pitch_25
Pitch_26
Pitch_27
Pitch_28
Pitch_29
Pitch_30
Pitch_31
Pitch_32
Pitch_33
Pitch_34
Pitch_35
Pitch_36
Pitch_37
Pitch_38
Pitch_39
Pitch_40
Pitch_41
Pitch_42
Pitch_43
Pitch_44
Pitch_45
Pitch_46
Pitch_47
Pitch_48
Pitch_49
Pitch_50
Pitch_51
Pitch_52
Pitch_53
Pitch_54
Pitch_55
Pitch_56
Pitch_57
Pitch_58
Pitch_59
Pitch_60
Pitch_61
Pitch_62
Pitch_63
Pitch_64
Pitch_65
Pitch_66
Pitch_67
Pitch_68
Pitch_69
Pitch_70
Pitch_71
Pitch_72
Pitch_73
Pitch_74
Pitch_75
Pitch_76
Pitch_77
Pitch_78
Pitch_79
Pitch_80
Pitch_81
Pitch_82
Pitch_83
Pitch_84
Pitch_85
Pitch_86
Pitch_87
Pitch_88
Pitch_89
Pitch_90
Pitch_91
Pitch_92
Pitch_93
Pitch_94
Pitch_95
Pitch_96
Pitch_97
Pitch_98
Pitch_99
Pitch_100
Pitch_101
Pitch_102
Pitch_103
Pitch_104
Pitch_105
Pitch_106
Pitch_107
Pitch_108
Pitch_109
Pitch_110
Pitch_111
Pitch_112
Pitch_113
Pitch_114
Pitch_115
Pitch_116
Pitch_117
Pitch_118
Pitch_119
Pitch_120
Pitch_121
Pitch_122
Pitch_123
Pitch_124
Pitch_125
Pitch_126
Pitch_127
Pitch_Drum0
Pitch_Drum1
Pitch_Drum2
Pitch_Drum3
Pitch_Drum4
Pitch_Drum5
Pitch_Drum6
Pitch_Drum7
Pitch_Drum8
Pitch_Drum9
Pitch_Drum10
Pitch_Drum11
Pitch_Drum12
Pitch_Drum13
Pitch_Drum14
Pitch_Drum15
Pitch_Drum16
Pitch_Drum17
Pitch_Drum18
Pitch_Drum19
Pitch_Drum20
Pitch_Drum21
Pitch_Drum22
Pitch_Drum23
Pitch_Drum24
Pitch_Drum25
Pitch_Drum26
Pitch_Drum27
Pitch_Drum28
Pitch_Drum29
Pitch_Drum30
Pitch_Drum31
Pitch_Drum32
Pitch_Drum33
Pitch_Drum34
Pitch_Drum35
Pitch_Drum36
Pitch_Drum37
Pitch_Drum38
Pitch_Drum39
Pitch_Drum40
Pitch_Drum41
Pitch_Drum42
Pitch_Drum43
Pitch_Drum44
Pitch_Drum45
Pitch_Drum46
Pitch_Drum47
Pitch_Drum48
Pitch_Drum49
Pitch_Drum50
Pitch_Drum51
Pitch_Drum52
Pitch_Drum53
Pitch_Drum54
Pitch_Drum55
Pitch_Drum56
Pitch_Drum57
Pitch_Drum58
Pitch_Drum59
Pitch_Drum60
Pitch_Drum61
Pitch_Drum62
Pitch_Drum63
Pitch_Drum64
Pitch_Drum65
Pitch_Drum66
Pitch_Drum67
Pitch_Drum68
Pitch_Drum69
Pitch_Drum70
Pitch_Drum71
Pitch_Drum72
Pitch_Drum73
Pitch_Drum74
Pitch_Drum75
Pitch_Drum76
Pitch_Drum77
Pitch_Drum78
Pitch_Drum79
Pitch_Drum80
Pitch_Drum81
Pitch_Drum82
Pitch_Drum83
Pitch_Drum84
Pitch_Drum85
Pitch_Drum86
Pitch_Drum87
Pitch_Drum88
Pitch_Drum89
Pitch_Drum90
Pitch_Drum91
Pitch_Drum92
Pitch_Drum93
Pitch_Drum94
Pitch_Drum95
Pitch_Drum96
Pitch_Drum97
Pitch_Drum98
Pitch_Drum99
Pitch_Drum100
Pitch_Drum101
Pitch_Drum102
Pitch_Drum103
Pitch_Drum104
Pitch_Drum105
Pitch_Drum106
Pitch_Drum107
Pitch_Drum108
Pitch_Drum109
Pitch_Drum110
Pitch_Drum111
Pitch_Drum112
Pitch_Drum113
Pitch_Drum114
Pitch_Drum115
Pitch_Drum116
Pitch_Drum117
Pitch_Drum118
Pitch_Drum119
Pitch_Drum120
Pitch_Drum121
Pitch_Drum122
Pitch_Drum123
Pitch_Drum124
Pitch_Drum125
Pitch_Drum126
Pitch_Drum127
Pitch_inactive
Onset_0
Onset_12
Onset_24
Onset_36
Onset_48
Onset_60
Onset_72
Onset_84
Onset_96
Onset_108
Onset_120
Onset_132
Onset_144
Onset_156
Onset_168
Onset_180
Onset_192
Onset_204
Onset_216
Onset_228
Onset_240
Onset_252
Onset_264
Onset_276
Onset_288
Onset_300
Onset_312
Onset_324
Onset_336
Onset_348
Onset_360
Onset_372
Onset_384
Onset_396
Onset_408
Onset_420
Onset_432
Onset_444
Onset_456
Onset_468
Onset_480
Onset_492
Onset_504
Onset_516
Onset_528
Onset_540
Onset_552
Onset_564
Onset_576
Onset_588
Onset_600
Onset_612
Onset_624
Onset_636
Onset_648
Onset_660
Onset_672
Onset_684
Onset_696
Onset_708
Onset_720
Onset_732
Onset_744
Onset_756
Onset_768
Onset_780
Onset_792
Onset_804
Onset_816
Onset_828
Onset_840
Onset_852
Onset_864
Onset_876
Onset_888
Onset_900
Onset_912
Onset_924
Onset_936
Onset_948
Onset_960
Onset_972
Onset_984
Onset_996
Onset_1008
Onset_1020
Onset_1032
Onset_1044
Onset_1056
Onset_1068
Onset_1080
Onset_1092
Onset_1104
Onset_1116
Onset_1128
Onset_1140
Onset_1152
Onset_1164
Onset_1176
Onset_1188
Onset_1200
Onset_1212
Onset_1224
Onset_1236
Onset_1248
Onset_1260
Onset_1272
Onset_1284
Onset_1296
Onset_1308
Onset_1320
Onset_1332
Onset_1344
Onset_1356
Onset_1368
Onset_1380
Onset_1392
Onset_1404
Onset_1416
Onset_1428
Onset_1440
Onset_1452
Onset_1464
Onset_1476
Onset_1488
Onset_1500
Onset_1512
Onset_1524
Onset_inactive
Microtiming_0
Microtiming_1
Microtiming_2
Microtiming_3
Microtiming_4
Microtiming_5
Microtiming_6
Microtiming_7
Microtiming_8
Microtiming_9
Microtiming_10
Microtiming_11
Microtiming_inactive
Offset_0
Offset_12
Offset_24
Offset_36
Offset_48
Offset_60
Offset_72
Offset_84
Offset_96
Offset_108
Offset_120
Offset_132
Offset_144
Offset_156
Offset_168
Offset_180
Offset_192
Offset_204
Offset_216
Offset_228
Offset_240
Offset_252
Offset_264
Offset_276
Offset_288
Offset_300
Offset_312
Offset_324
Offset_336
Offset_348
Offset_360
Offset_372
Offset_384
Offset_396
Offset_408
Offset_420
Offset_432
Offset_444
Offset_456
Offset_468
Offset_480
Offset_492
Offset_504
Offset_516
Offset_528
Offset_540
Offset_552
Offset_564
Offset_576
Offset_588
Offset_600
Offset_612
Offset_624
Offset_636
Offset_648
Offset_660
Offset_672
Offset_684
Offset_696
Offset_708
Offset_720
Offset_732
Offset_744
Offset_756
Offset_768
Offset_780
Offset_792
Offset_804
Offset_816
Offset_828
Offset_840
Offset_852
Offset_864
Offset_876
Offset_888
Offset_900
Offset_912
Offset_924
Offset_936
Offset_948
Offset_960
Offset_972
Offset_984
Offset_996
Offset_1008
Offset_1020
Offset_1032
Offset_1044
Offset_1056
Offset_1068
Offset_1080
Offset_1092
Offset_1104
Offset_1116
Offset_1128
Offset_1140
Offset_1152
Offset_1164
Offset_1176
Offset_1188
Offset_1200
Offset_1212
Offset_1224
Offset_1236
Offset_1248
Offset_1260
Offset_1272
Offset_1284
Offset_1296
Offset_1308
Offset_1320
Offset_1332
Offset_1344
Offset_1356
Offset_1368
Offset_1380
Offset_1392
Offset_1404
Offset_1416
Offset_1428
Offset_1440
Offset_1452
Offset_1464
Offset_1476
Offset_1488
Offset_1500
Offset_1512
Offset_1524
Offset_1536
Offset_1548
Offset_1560
Offset_1572
Offset_1584
Offset_1596
Offset_1608
Offset_1620
Offset_inactive
Duration_12
Duration_24
Duration_48
Duration_96
Duration_192
Duration_384
Duration_768
Duration_1536
Duration_inactive
Velocity_1
Velocity_5
Velocity_9
Velocity_13
Velocity_17
Velocity_21
Velocity_25
Velocity_29
Velocity_34
Velocity_38
Velocity_42
Velocity_46
Velocity_50
Velocity_54
Velocity_58
Velocity_62
Velocity_66
Velocity_70
Velocity_74
Velocity_78
Velocity_82
Velocity_86
Velocity_90
Velocity_94
Velocity_99
Velocity_103
Velocity_107
Velocity_111
Velocity_115
Velocity_119
Velocity_123
Velocity_127
Velocity_inactive
